Repository: oqughin/Typora-i18n
Catalog: *.lproj/Front.strings
Languages: ug

source: OK
ug: مۇقۇملاش

source: Cancel
ug: قالدۇرۇش

source: Yes
ug: ھەئە

source: No
ug: ياق

source: Close
ug: تاقاش

source: Select
ug: تاللاش

source: Continue
ug: داۋاملاشتۇرۇش

source: Learn More…
ug: ...تېخىمۇ كۆپ

source: Untitled
ug: نامسىز

source: Undo
ug: ياندۇرۇش

source: Dismiss
ug: تاقاش

source: Confirm
ug: مۇقۇملاش

source: Error
ug: خاتالىق

source: Search
ug: ئىزدەش

source: Replace
ug: ئالماشتۇرۇش

source: All
ug: ھەممىسى

source: Search text not found in article
ug: ئىزدىگەن مەزمۇن تېپىلمىدى

source: search text
ug: مەزمۇن ئىزدەش

source: Search by file name
ug: ھۆججەت نامى بويىچە ئىزدەش

source: Searching
ug: ئىزدەۋاتىدۇ

source: Gathering more results
ug: تېخىمۇ كۆپ نەتىجە يۈكلىنىۋاتىدۇ

source: Insert Table
ug: جەدىۋەل قىستۇرۇش

source: Columns
ug: قاتار

source: Rows
ug: رەت

source: Align Left
ug: سولغا توغرىلاش

source: Align Center
ug: ئوتتۇرىغا توغرىلاش

source: Align Right
ug: ئوڭغا توغرىلاش

source: Resize Table
ug: جەدىۋەلنى تۈزەش

source: Delete Table
ug: جەدىۋەلنى ئۆچۈرۈش

source: Typora are trying copy the newly inserted image to folder <code id='image-create-folder-target'></code> according to your YAML Front Matter setting or global preferences. But the target folder does not exist, create it now?
ug: ‫YAML Front Matter ياكى ئومۇمىي تەڭشەكتىكى سەپلىمىگە ئاساسەن، Typora يېڭىدىن قوشقان رەسىمنى <code id='image-create-folder-target'></code> ھۆججەت قىسقۇچىغا كۆپەيتمەكچى. لېكىن مەزكۇر مۇندەرىجە مەۋجۇت بولمىغانلىقى ئۈچۈن يېڭىدىن قۇرماقچى، قوشۇلامسىز؟

source: Create Folder
ug: ھۆججەت قىسقۇچ قۇرۇش

source: Edit
ug: تەھرىرلەش

source: Delete Math
ug: فورمۇلانى ئۆچۈرۈش

source: Preview
ug: كۆرۈش

source: Articles
ug: ئارخىپ

source: Outline
ug: تېزىس

source: Files
ug: ھۆججەت

source: Switch to File List view
ug: ئارخىپ تىزىملىكىگە ئالماشتۇرۇش

source: Switch to File Tree view
ug: ھۆججەت دەرىخىگە ئالماشتۇرۇش

source: Switch to Outline view
ug: تېزىس كۆرۈنمىسىگە ئالماشتۇرۇش

source: Close sidebar
ug: يان رامكىنى تاقاش

source: Loading
ug: يۈكلىنىۋاتىدۇ

source: Selected folders contains too many files. Please switch to <a id='switch-to-tree-on-oversize'>File Tree view</a> for better performance.
ug: ‫نۆۋەتتىكى ھۆججەت قىسقۇچتا ھۆججەت ھەددىدىن زىيادە كۆپ، <a id='switch-to-tree-on-oversize'> ھۆججەت دەرىخىگە ئالماشتۇرۇپ </a> تېخىمۇ راۋان ئىشلىتىڭ

source: New File
ug: ھۆججەت قۇرۇش

source: Unpin Outline Panel
ug: تېزىس كۆرۈنمىسىنى تاقاش

source: Open Folder...
ug: ...ھۆججەت قىسقۇچ ئېچىش

source: Action
ug: مەشغۇلات

source: Close Sidebar Menu
ug: تاقاش

source: Reveal in Finder
ug: دە كۆرسىتىشFinder

source: Reveal in File Explorer
ug: مەنبە باشقۇرغۇچتا كۆرسىتىش

source: Refresh Folder
ug: يېڭىلاش

source: Sort
ug: رەتلەش

source: Group By Folder
ug: ھۆججەت قىسقۇچ بويىچە گۇرۇپپىلاش

source: Sort Naturally (Ascending)
ug: تەبئىي رەتلەش (ئۆرلىمە تەرتىپ)

source: Sort Naturally (Descending)
ug: تەبئىي رەتلەش (تۆۋەنلىمە تەرتىپ)

source: Sort by Name (Ascending)
ug: ھۆججەت نامى بويىچە رەتلەش (ئۆرلىمە تەرتىپ)

source: Sort by Modification Date (Ascending)
ug: ئۆزگەرتكەن ۋاقىت بويىچە رەتلەش (ئۆرلىمە تەرتىپ)

source: Sort by Name (Descending)
ug: ھۆججەت نامى بويىچە رەتلەش (تۆۋەنلىمە تەرتىپ)

source: Sort by Modification Date (Descending)
ug: ئۆزگەرتكەن ۋاقىت بويىچە رەتلەش (تۆۋەنلىمە تەرتىپ)

source: Location
ug: مۇندەرىجە

source: Switch File List/Tree View
ug: جەدىۋەل/دەرەخ كۆرۈنمىسىگە ئالماشتۇرۇش

source: No Files Available
ug: ھۆججەت تىزىملىكى قۇرۇق

source: No Folder is Opened.
ug: ھۆججەت قىسقۇچ يوق

source: Outline is Empty.
ug: تېزىس مەزمۇنى قۇرۇق

source: Toggle Sidebar
ug: يان رامكىنى كۆرسىتىش / يوشۇرۇش

source: Toggle Source Code Mode
ug: ئەسلى كود ھالىتىنى قوزغىتىش

source: Exit Source Code Mode
ug: ئەسلى كود ھالىتىدىن چېكىنىش

source: Table of Contents
ug: مۇندەرىجە

source: Empty Diagram
ug: قۇرۇق

source: Input Math TeX here
ug: ‫بۇ يەرگە Tex فورمۇلاسى يېزىڭ

source: Need to define the reference footnote <b>{0}</b> with syntax <a>[^{1}]: www.example.com</a>
ug: ‫<a>[^{1}]: www.example.com</a> گىرامماتىكىسى بويىچە ‫ئىزاھاتنى ئېنىقلاڭ <b>{0}</b>

source: Need to define the reference link <b>[{0}]</b> with syntax <b>[{1}]: www.example.com</b>
ug: ‫<b>[{1}]: www.example.com</b> گىرامماتىكىسى بويىچە ئۇلانمىنى ئېنىقلاڭ <b>[{0}]</b>

source: Please define image reference by [{0}]: http://example.png
ug: ‫ [{0}]: http://example.png گىرامماتىكىسى بويىچە رەسىمگە ئېنىقلىما بېرىڭ

source: Failed to create file
ug: ھۆججەت قۇرۇلمىدى

source: Failed to create folder
ug: ھۆججەت قىسقۇچ قۇرۇلمىدى

source: Failed to rename file
ug: ھۆججەتكە قايتا نام قويۇش مەغلۇب بولدى

source: Folder does not exist at %@
ug: مۇندەرىجە %@ مەۋجۇت ئەمەس

source: File with the same name already exists at target path
ug: ئوخشاش نامدىكى ھۆججەت ئاللىقاچان مەۋجۇت

source: Apply to All
ug: ھەممىگە قوللىنىش

source: Overwrite
ug: ئالماشتۇر

source: Stop
ug: توختا

source: back to document
ug: ئارخىپقا قايتىش

source: Failed to load file
ug: ھۆججەت يۈكلەنمىدى

source: Save File Failed!
ug: ساقلاش مەغلۇب بولدى

source: Cannot open folder {0}
ug: {0}ھۆججەت قىسقۇچنى ئاچقىلى بولمىدى

source: File content is changed by external applications. Reload content from disk ?
ug: تاشقى پىروگرامما ھۆججەتنى ئۆزگەرتىۋەتتى، قايتىدىن يۈكلەمسىز؟

source: Should continue moving and overwrite exisiting file(s) ?
ug: ئەسلىدىكى ھۆججەتنى يۆتكەش ۋە ئالماشتۇرشنى داۋاملاشتۇرامسىز؟

source: Rename Failed
ug: قايتا ناملاش مەغلۇب بولدى

source: Rename to "{0}" ?
ug: يېڭى نامىنى "{0}" قويامسىز؟

source: Failed to rename from "{0}" to "{1}"
ug: نامىنى "{0}" دىن "{1}" غا ئالماشتۇرۇش مەغلۇب بولدى

source: Successfully uploaded {0} images.
ug: دانە رەسىم چىقىرىلدى {0}

source: Failed to upload image. Error Message:
ug: :رەسىم چىقىرىش مەغلۇب بولدى، خاتالىق

source: Failed to Copy Image to Target Folder.
ug: رەسىمنى نىشان مۇندەرىجىگە كۆپەيتىش مەغلۇب بولدى

source: Select Container Folder
ug: رەسىم ساقلاش ئورنىنى تاللاڭ

source: Saved
ug: ساقلاندى
