Repository: oqughin/Typora-i18n
Catalog: *.lproj/Menu.strings
Languages: ug

source: About Typora
ug: ھەققىدە

source: Preferences
ug: مايىللىقلار

source: Check for Updates
ug: يېڭىلانما تەكشۈرۈش

source: Services
ug: مۇلازىمەت

source: Hide Typora
ug: نى يوشۇرۇشTypora

source: Hide Others
ug: باشقىنى يوشۇرۇش

source: Show All
ug: ھەممىنى كۆرسىتىش

source: Quit Typora
ug: چېكىنىش

source: File
ug: ھۆججەت

source: New
ug: يېڭىدىن قۇرۇش

source: Open
ug: ئېچىش

source: Open Folder
ug: قىسقۇچ ئېچىش

source: Reopen with Encoding
ug: كودلاپ قايتا ئېچىش

source: Auto
ug: ئاپتوماتىك

source: Open Recent
ug: يېقىنقى ھۆججەتنى ئېچىش

source: Recent Locations
ug: يېقىنقى ئورۇنلار

source: Clear Items
ug: يېقىنقى ھۆججەتلەرنى تازىلاش

source: No Recent Files
ug: قۇرۇق

source: Open Quickly
ug: تېز ئېچىش

source: Open File Location
ug: ھۆججەت ئورنىنى ئېچىش

source: Reveal in Library
ug: ئارخىپ تىزىملىكىدە كۆرسىتىش

source: Reveal in File Tree
ug: ھۆججەتلەردە كۆرسىتىش

source: Close
ug: تاقاش

source: Save
ug: ساقلاش

source: Save As
ug: باشقا نامدا ساقلاش

source: Duplicate
ug: نۇسخىلاش

source: Rename
ug: نام ئۆزگەرتىش

source: Move To
ug: يۆتكەش

source: Revert To
ug: ئەسلىگە كەلتۈرۈش

source: Browse All Versions
ug: ھەممە نەشىرىنى كۆرۈش

source: Import
ug: ئەكىرىش

source: Export
ug: چىقىرىش

source: Page Setup
ug: بەت تەڭشەش

source: Print
ug: بېسىش

source: Edit
ug: تەھرىرلەش

source: Undo
ug: يېنىش

source: Redo
ug: قايتىلاش

source: Cut
ug: كېسىش

source: Copy
ug: كۆپەيتىش

source: Paste
ug: چاپلاش

source: Copy as Markdown
ug: بويىچە كۆپەيتىش Markdown

source: Copy as HTML Code
ug: كودى بويىچە كۆپەيتىش HTML

source: Paste as Plain Text
ug: تېكىست ھالىتىدە چاپلاش

source: Select All
ug: ھەممىنى تاللاش

source: Select Line/Sentence
ug: نۆۋەتتىكى قۇر/جۈملىنى تاللاش

source: Select Styled Scope
ug: نۆۋەتتىكى ئۇسلۇب تېكىستنى تاللاش

source: Select Word
ug: نۆۋەتتىكى سۆزنى تاللاش

source: Delete
ug: ئۆچۈرۈش

source: Delete Range
ug: ئۆچۈرۈش دائىرىسى

source: Delete Word
ug: نۆۋەتتىكى سۆزنى ئۆچۈرۈش

source: Delete Styled Scope
ug: نۆۋەتتىكى ئۇسلۇب تېكىستىنى ئۆچۈرۈش

source: Delete Line/Sentence
ug: نۆۋەتتىكى قۇر/جۈملىنى ئۆچۈرۈش

source: Jump To
ug: سەكىرەش

source: Jump to Top
ug: يازما بېشىغا سەكىرەش

source: Jump to Selection
ug: تاللانغان ئورۇنغا سەكىرەش

source: Jump to Bottom
ug: يازما ئاخىرىغا سەكىرەش

source: Math Tools
ug: ماتېماتىكا قورالى

source: Refresh All Math Expressions
ug: بارىلىق فورمۇلانى يېڭىلاش

source: Image Tools
ug: رەسىم قورالى

source: Insert Local Images
ug: يەرلىكتىكى رەسىمنى قىستۇرۇش

source: Upload Local Images via iPic
ug: نى ئىشلىتىپ يەرلىكتىكى رەسىمنى يۈكلەش iPic

source: When Insert Local Image
ug: يەرلىكتىكى رەسىمنى قىستۇرغاندا

source: Copy Image File to Folder
ug: رەسىمنى ھۆججەت قىسقۇچقا كۆپەيتىش

source: Use Image Root Path
ug: رەسىم غول مۇندەرىجىسىنى تەڭشەش

source: Line Endings
ug: قۇر بۆلگۈچ

source: Windows Line Endings (CRLF)
ug: (CRLF) قۇر بۆلگۈچى Windows

source: Unix Line Endings (LF)
ug: (LF) قۇر بۆلگۈچى Unix

source: Find
ug: ئىزدەش

source: Find Next
ug: كېيىنكىنى ئىزدەش

source: Find Previous
ug: ئالدىنقىنى ئىزدەش

source: Find and Replace
ug: ئىزدەش ۋە ئالماشتۇرۇش

source: Replace
ug: ئالماشتۇرۇش

source: Replace Next
ug: كېيىنكىنى ئالماشتۇرۇش

source: Spelling and Grammar
ug: ئىملا ۋە گىرامماتىكا تەكشۈرۈش

source: Check Document Now
ug: يازمىنى ھازىرلا تەكشۈرۈش

source: Check Spelling While Typing
ug: يېزىۋاتقاندا ئىملا تەكشۈرۈش

source: Check Grammar With Spelling
ug: ئىملا ۋە گىرامماتىكىنى تەكشۈرۈش

source: Correct Spelling Automatically
ug: ئاپتوماتىك ئىملا توغرىلاش

source: Substitutions
ug: ئالماشتۇرۇش

source: Smart Quotes
ug: ئەقلىي قوش پەش

source: Smart Dashes
ug: ئەقلىي سىزىق

source: Text Replacement
ug: تېكىست ئالماشتۇرۇش

source: Speech
ug: تاۋۇش

source: Start Speaking
ug: ئوقۇتۇش

source: Stop Speaking
ug: ئوقۇشنى توختىتىش

source: Paragraph
ug: ئابزاس

source: Heading 1
ug: ماۋزۇ 1

source: Heading 2
ug: ماۋزۇ 2

source: Heading 3
ug: ماۋزۇ 3

source: Heading 4
ug: ماۋزۇ 4

source: Heading 5
ug: ماۋزۇ 5

source: Heading 6
ug: ماۋزۇ 6

source: Increase Heading Level
ug: ماۋزۇ دەرىجىسىنى كۆتۈرۈش

source: Decrease Heading Level
ug: ماۋزۇ دەرىجىسىنى چۈشۈرۈش

source: Table
ug: جەدىۋەل

source: Code Fences
ug: كود بۆلىكى

source: Math Block
ug: فورمۇلا بۆلىكى

source: Quote
ug: نەقىل

source: Ordered List
ug: تەرتىپلىك تىزىملىك

source: Unordered List
ug: تەرتىپسىز تىزىملىك

source: Task List
ug: ۋەزىپە تىزىملىكى

source: Task Status
ug: ۋەزىپە ھالىتى

source: Toggle Task Status
ug: ۋەزىپە ھالىتىنى ئالماشتۇرۇش

source: Mark as Complete
ug: تاماملاندى قىلىش

source: Mark as Incomplete
ug: تاماملانمىدى قىلىش

source: List Indentation
ug: تىزىملىك كىرتىكى

source: Indent
ug: كىرتىك ئاشۇرۇش

source: Outdent
ug: كىرتىك ئازايتىش

source: Link Reference
ug: ئۇلانما نەقلى

source: Footnotes
ug: ئىزاھ

source: Horizontal Line
ug: گورىزونتال كەسمە سىزىق

source: Table of Contents
ug: مەزمۇن مۇندەرىجىسى

source: Format
ug: فورمات

source: Strong
ug: توملىتىش

source: Emphasis
ug: يانتۇ

source: Underline
ug: ئاستىغا سىزىش

source: Code
ug: كود

source: Inline Math
ug: قۇردىكى فورمۇلا

source: Strike
ug: ئۆچۈرمە سىزىق

source: Highlight
ug: گەۋدىلەندۈرۈش

source: Superscript
ug: ئۈستبەلگە

source: Subscript
ug: ئاستبەلگە

source: Comment
ug: ئىزاھات

source: Hyperlink
ug: ئۇلانما

source: Image
ug: رەسىم

source: Clear Format
ug: ئۇسلۇبنى تازىلاش

source: View
ug: كۆرۈنۈش

source: New Tab
ug: يېڭى بەتكۈچ

source: Source Code Mode
ug: ئەسلى كود ھالىتى

source: Focus Mode
ug: دىققەت ھالىتى

source: Typewriter Mode
ug: خەتباسقۇ ھالىتى

source: Toggle Sidebar
ug: يانبالداقنى كۆرسەت/يوشۇر

source: Outline
ug: تىزىس

source: Articles
ug: ماقالە تىزىملىكى

source: File Tree
ug: ھۆججەتلەر

source: Always on Top
ug: كۆزنەكنى ئەڭ ئۈستىدە كۆرسەت

source: Full Screen
ug: پۈتۈن ئېكران

source: Show Status Bar
ug: ھالەت سىتونىنى كۆرسىتىش

source: Toggle Fullscreen
ug: پۈتۈن ئېكرانغا ئالماشتۇرۇش

source: Actual Size
ug: ئەمەلىي چوڭلىقى

source: Zoom In
ug: چوڭايتىش

source: Zoom Out
ug: كىچىكلىتىش

source: Switch Between Opened Documents
ug: ئېچىلغان ماقالىلەر ئارىسىدا ئالماشتۇرۇش

source: Toggle DevTools
ug: ئاچقۇچىلار قورالى

source: Themes
ug: ئۇسلۇب

source: Window
ug: كۆزنەك

source: Minimize
ug: كىچىكلىتىش

source: Zoom
ug: چوڭ-كىچىكلىتىش

source: Bring All to Front
ug: ھەممە كۆزنەكنى ئالدىغا

source: Help
ug: ياردەم

source: More Topics
ug: تېخىمۇ كۆپ ئۇسلۇبلار

source: Privacy Policy
ug: مەخپىيەتلىك كېلىشىمى

source: Credits
ug: تەشەككۈرلەر

source: Change Log
ug: يېڭىلانما خاتىرىسى

source: Website
ug: توربەت

source: Feedback
ug: ئىنكاس قىلىش

source: Check Updates
ug: يېڭىلانمىلارنى تەكشۈرۈش

source: About
ug: ھەققىدە

source: Block Styles
ug: بۆلەك ئۇسلۇبى

source: Inline Styles
ug: قۇر ئۇسلۇبى

source: List Styles / Remove Block
ug: تىزىملىك ئۇسلۇبى/بۆلەكنى چىقىرىۋېتىش

source: Exit Source Code Mode
ug: ئەسلى كود ھالىتىدىن چېكىنىش

source: Toggle Source Code Mode
ug: ئەسلى كود ھالىتىنى قوزغىتىش

source: Add Row Above
ug: ئۈستىگە قۇر قىستۇرۇش

source: Add Row Below
ug: ئاستىغا قۇر قىستۇرۇش

source: Delete Row
ug: قۇر ئۆچۈرۈش

source: Add Column Before
ug: سولغا رەت قوشۇش

source: Add Column After
ug: ئوڭغا رەت قوشۇش

source: Delete Column
ug: رەت ئۆچۈرۈش

source: Copy Table
ug: جەدىۋەل كۆپەيتىش

source: Delete Table
ug: جەدىۋەل ئۆچۈرۈش

source: Insert Paragraph Before
ug: ئۈستىگە ئابزاس قوشۇش

source: Insert Paragraph After
ug: ئاستىغا ئابزاس قوشۇش

source: Delete Code Block
ug: كود بۆلىكىنى ئۆچۈرۈش

source: Copy as MathML
ug: شەكلىدە كۆپەيتىش MathML

source: Copy as Tex
ug: كودى شەكلىدە كۆپەيتىش Tex

source: Copy Math
ug: فورمۇلانى كۆپەيتىش

source: Reveal in Finder
ug: دا كۆرسىتىش Finder

source: Open Link
ug: ئۇلانمىنى ئېچىش

source: Reveal in Sidebar
ug: يانبالداقتا كۆرسىتىش

source: Open in New Window
ug: يېڭى كۆزنەكتە ئېچىش

source: Copy File Path
ug: ھۆججەت يولىنى كۆپەيتىش

source: New File
ug: يېڭى ھۆججەت قۇرۇش

source: New Folder
ug: يېڭى قىسقۇچ قۇرۇش

source: Learn Spelling
ug: لۇغەتكە قوشۇش

source: Copy / Paste As…
ug: كۆپەيتىپ/چاپلاش...

source: Math
ug: فورمۇلا

source: Insert
ug: قىستۇرۇش

source: Inspect Element
ug: ئېلمېنتنى تەكشۈرۈش

source: Copy to MS Word
ug: ۋوردقا كۆپەيتىش

source: Paragraph (before)
ug: ئابزاس (ئۈستۈنكى)

source: Paragraph (after)
ug: ئابزاس (ئاستىنقى)

source: Search with Google
ug: گوگىلدىن ئىزدەش

source: Search With…
ug: …ئىزدەش

source: Open Failed
ug: ئېچىلمىدى

source: File or folder does not exist.
ug: ھۆججەت ياكى قىسقۇچ مەۋجۇت ئەمەس.

source: Prettify Source Code
ug: جەدىۋەل كودىنى فورماتلاش

source: Copy '%@'
ug: نى كۆپەيتىش '%@'

source: Copy to %@
ug: غا كۆپەيتىش %@

source: Copy Image to
ug: رەسىمنى كۆپەيتىش

source: Open Image Location
ug: رەسىم ئورنىنى ئېچىش

source: Learn More
ug: تەپسىلاتى

source: Whitespace and Line Breaks
ug: بوشلۇق ۋە قۇر بۆلگۈچ

source: Indent first line of paragraphs
ug: باش قۇرنى قىسىش

source: Preserve single line break
ug: يالغۇز قۇر بۆلگۈچنى قالدۇرۇش

source: Visible <br/>
ug: كۆرسىتىش <br/>

source: Save All
ug: ئاچقان ھەممە ھۆججەتنى ساقلاش

source: New Window
ug: يېڭى كۆزنەك

source: Reopen Closed File
ug: تاقىغان ھۆججەتلەرنى قايتا ئېچىش

source: Global Image Settings
ug: ھەممە رەسىمنى تەڭشەش

source: Smart Punctuation
ug: تىنىش بەلگىلەرنى ئاپتوماتىك قويۇش

source: Convert on Input
ug: كىرگۈزگەندە ئالماشتۇرۇش

source: Convert on Rendering
ug: ھاسىللىغاندا ئالماشتۇرۇش

source: Remap Unicode Punctuation on Parse
ug: نى ئانالىز قىلغاندا يۇنىكود بەلگىلىرىگە ئالماشتۇرۇشقا قوشۇلۇش Markdown

source: More Options
ug: تاللانمىلار

source: HTML Block
ug: مەزمۇنى HTML

source: Delete Block
ug: بۆلەكنى ئۆچۈرۈش

source: Delete %@
ug: نى ئۆچۈرۈش %@

source: Play
ug: قويۇش

source: Pause
ug: توختىتىش

source: Spell Check
ug: ئىملا تەكشۈرۈش

source: Unlearn Spelling
ug: ئىملا تەكشۈرۈكسىز

source: Properties
ug: خاسلىق

source: Search
ug: ئىزدەش

source: Copy without Theme Styling
ug: مەزمۇننى فورماتسىز كۆپەيتىش

source: Recent Files
ug: يېقىندا ئاچقانلىرىم

source: File Results
ug: ھۆججەت نەتىجىسى

source: Insert Table
ug: جەدىۋەل قىستۇرۇش

source: Insert Image
ug: رەسىم قىستۇرۇش

source: Allow Magnification
ug: قوش بارماقتا چوڭ-كىچىكلىتىش

source: Move Row Up
ug: بۇ قۇرنى ئۈستىگە يۆتكەش

source: Move Row Down
ug: بۇ قۇرنى ئاستىغا يۆتكەش

source: Move Column Left
ug: بۇ رەتنى سولغا يۆتكەش

source: Move Column Right
ug: بۇ رەتنى ئوڭغا يۆتكەش

source: Zoom Image
ug: رەسىمنى چوڭ-كىچىكلىتىش

source: Zoom Image to %@
ug: رەسىمنى %@ چوڭ-كىچىكلىتىش

source: Copy as Plain Text
ug: تېكىست شەكلىدە كۆچۈرۈش

source: Selection
ug: تاللاش

source: HTML (without Styles)
ug: (ئۇسلۇبسىز) HTML

source: Highlight Current Header
ug: نۆۋەتتىكى ماۋزۇنى گەۋدىلەندۈرۈش

source: Expand All
ug: ھەممىنى يېيىش

source: Collapse All
ug: ھەممىنى يىغىش

source: Collapsible Outline
ug: تىزىس كۆرۈنۈشى (يىغقسىز)

source: Flat Outline
ug: تىزىس كۆرۈنۈشى (يىغىقلىق)

source: Articles (List View)
ug: ماقالە تىزىملىكى

source: File Tree (Tree View)
ug: ھۆججەتلەر

source: Filter
ug: ئىزدەش

source: Upload Image
ug: رەسىم يۈكلەش

source: Upload All Local Images
ug: يەرلىكتىكى ھەممە رەسىمنى يۈكلەش

source: Open Image in Browser
ug: رەسىمنى تور كۆرگۈدە ئېچىش

source: Copy Image
ug: رەسىمنى كۆپەيتىش

source: More Actions
ug: تېخىمۇ كۆپ مەشغۇلات

source: Get Info
ug: تونۇشتۇرىشىنى كۆرسىتىش

source: Export with Previous
ug: ئالدىدىكى تەڭشەك بويىچە چىقىرىش

source: Export and Overwrite with Previous
ug: ئالدىدا چىقارغان ھۆججەتنى قاپلاش ۋە چىقىرىش

source: Emoji and Symbols
ug: چىرايچە ۋە بەلگە

source: Insert Final New Line On Save
ug: ساقلىغاندا ھۆججەت ئاخىرىغا قۇرۇق قۇر قوشۇش

source: Hyperlink Actions
ug: ئۇلانما مەشغۇلاتى

source: Copy Link Address
ug: ئۇلانما ئادرېسىنى كۆپەيتىش

source: Click
ug: چېكىش

source: Export Setting
ug: چىقىرىش تەڭشىكى

source: My License
ug: ئىجازەتنامەم

source: Registration / Activation
ug: ئىجازەتنامە ئۇچۇرى

source: Select Paragraph/Block
ug: ئابزاس/بۆلەك تاللاش
